---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentChangedEventArgs.Operation
source: html/02ac0e7c-213b-ff2c-d9be-45d066964f07.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs.Operation Property

The operation associated with this event

## Syntax (C#)
```csharp
public UndoOperation Operation { get; }
```